{
    "castInfo": [
        {
            "img": "img/character_sub_fig_01.jpg",
            "chracter": "Mike Wheeler",
            "cast": " / Finn Wolfhard",
            "info": "Michael 'Mike' Wheeler is the son of Karen and Ted, younger brother of Nancy and older brother of Holly, and is friends with Will Byers, Lucas Sinclair, and Dustin Henderson. Mike is an intelligent and conscientious student who is committed to his friends.         In their Dungeons and Dragons party, Mike is their paladin and usually plays the role of Dungeon Master. He develops romantic feelings for Eleven (or El, as Mike and his friends prefer to call her). In Season Two, it is revealed that he has developed a more rebellious streak, likely stemming from missing Eleven."
        },
        {
            "img": "img/character_sub_fig_02.jpg",
            "chracter": "Will Byers",
            "cast": " / Noah Schnapp",
            "info": "Will Byers the younger brother of Jonathan Byers and the son of Joyce Byers, is a shy, kind, and often timid boy. In the group's Dungeons and Dragons party, Will is the cleric, but later occasionally plays the role of Dungeon Master. In November 1983, he vanishes after encountering the monster that escaped through a rift to the 'Upside Down', an alternate dimension discovered by the Hawkins Laboratory scientists.[10] Schnapp was promoted to series regular for the second season, after recurring in the first."
        },
        {
            "img": "img/character_sub_fig_03.jpg",
            "chracter": "Dustin Henderson",
            "cast": " / Gaten Matarazzo",
            "info": "Dustin Henderson a friend of Mike, Will and Lucas, is a highly intelligent and studious boy whose cleidocranial dysplasia causes him to lisp. In their Dungeons and Dragons party, Dustin is the bard and has arguably the most extensive knowledge of the game, particularly the monsters. He had a crush on Nancy Wheeler, while both he and Lucas had feelings for Max in the second season, but Lucas and Max ultimately end up together. He befriends Steve Harrington in the second season, who gives him advice on how to make girls like him."
        },
        {
            "img": "img/character_sub_fig_04.jpg",
            "chracter": "Lucas Sinclair",
            "cast": " / Caleb McLaughlin",
            "info": "Lucas Charles Sinclair is a friend of Mike, Will and Dustin, and older brother to Erica. Lucas is initially wary of Eleven, yet befriends her later on. In Season Two, he becomes a love interest for Max. In their Dungeons and Dragons party, Lucas is the ranger. He is very skilled with the use of a slingshot, which the party calls \"The Wrist Rocket\"; in the first two seasons, the slingshot is used for comedic effect as a hopeless last-minute defense, but in the third season, is used to actually save the team from danger."
        },
        {
            "img": "img/character_sub_fig_05.jpg",
            "chracter": "Eleven",
            "cast": " / Millie Bobby Brown",
            "info": "Eleven was born as Jane Ives, daughter of Terry Ives and Andrew Rich (who died in Vietnam), and grew up in Hawkins Lab where she was experimented on by scientists until the beginning of season one. Eleven has telekinetic and telepathic powers, which allow her to control things with her mind. She escaped the lab and befriended Dustin, Will, Mike, and Lucas. In the Dungeons and Dragons party, she is the mage. In season two, Jim Hopper became a father figure to Eleven while searching for her biological mother, culminating in her adoption by Hopper at the end of the season and was named Jane Hopper."
        },
        {
            "img": "img/character_sub_fig_06.jpg",
            "chracter": "Max Mayfield",
            "cast": " / Sadie Sink",
            "info": "Maxine 'Max' Mayfield is Billy's younger stepsister, an avid skateboarder, and the tomboy of the group who catches the attention of both Lucas and Dustin. She also has the highest score in Dig Dug. [11] While she never played Dungeons and Dragons, she calls herself the 'zoomer' of the party, despite Mike's persistence that the term is made-up."
        },
        {
            "img": "img/character_sub_fig_07.jpg",
            "chracter": "Joyce Byers",
            "cast": " / Winona Ryder",
            "info": "Joyce Byers is the mother of Will and Jonathan Byers and is divorced from Lonnie Byers, the father of her two children. Joyce is a very caring and strong-willed woman who works as a retail clerk at Melvald's General Store in downtown Hawkins. She was born and raised in Hawkins and she attended Hawkins High School with the future chief of police, Jim Hopper, and her Season Two love interest, Bob Newby (who is later unfortunately killed by a demogorgon). In Season Three, she is planning to sell her house and move out of Hawkins, much to the dismay of Hopper who tries to convince her to go on a date with him."
        },
        {
            "img": "img/character_sub_fig_08.jpg",
            "chracter": "Jim Hopper",
            "cast": " / Gaten Matarazzo",
            "info": "Jim Hopper, nicknamed 'Hop', is the Hawkins chief of police. Hopper has lived in Hawkins nearly all his life, having attended high school with Joyce and Bob. Hopper divorced after his young daughter Sarah died of cancer, which caused him to lapse into alcoholism. Eventually, he grows to be more responsible, saving Will from the Demogorgon as well as taking Eleven in as his adopted daughter. In Season 3, he tries to break up El and Mike since their relationship is moving too fast for him, while trying to win over Joyce romantically."
        },
        {
            "img": "img/character_sub_fig_09.jpg",
            "chracter": "Nancy Wheeler",
            "cast": " / Natalia Dyer",
            "info": "Nancy Wheeler is the teenage daughter of Karen and Ted, older sister of Mike Wheeler and Holly Wheeler. Nancy is initially something of an outcast at school until popular student Steve Harrington takes an interest in her. Their relationship lasts until the beginning of season two when she starts dating Jonathan Byers after a little help from conspiracy theorist Murray Bauman. She is very proficient with firearms, despite a noticeable lack of training or practice. She has been seen using pistols, revolvers, rifles and shotguns."
        },
        {
            "img": "img/character_sub_fig_10.jpg",
            "chracter": "Jonathan Byers",
            "cast": " / Charlie Heaton",
            "info": "Jonathan Byers, the older brother of Will Byers and the son of Joyce Byers, is quiet and considered an outsider at school. He is an aspiring photographer, and very close with his mother and brother. He starts dating Nancy at the end of Season 2. They both become interns at the Hawkins Post in Season 3, but are eventually fired by their editor. He moves out of Hawkins with Joyce, Will, and Eleven at the end of Season 3."
        }
    ]
}